export const WORKS_CONTENTS = [
  {
    id: 1,
    title: '公立小学校',
    created: '2019年2月頃',
    period: '4ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://sacck.me/school/',
    description:
      'Webの勉強を始め、WordPressについて学び始めた頃に制作したサイトです。デザイン、静的コーディングからWordPress化まで行いました。\n知り合いにいた小学校関係者から写真素材の提供を受けながら、制作を開始しました。小学校のHPを訪れる方々のニーズを考えながら、当時の限られたスキルを駆使し、試行錯誤をしながら一通りの制作をしました。実際の公開はできませんでしたが、初めて最後まで手がけたWebサイトなので、非常に思い入れがあります。',
    authentication: true,
  },
  {
    id: 2,
    title: '行きつけの理容室',
    created: '2019年2月頃',
    period: '1.5ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://sacck.me/barber/',
    description:
      'デザイン・コーディングの練習のために制作できないかと思い、店主さんから許可を得て制作しました。無料で提供されていたHTMLテンプレートをベースに、アレンジを加えてデザインとコーディングを行いました。店内の雰囲気とマッチするよう、ブラウンをメインカラーとしてデザインしました。シンプルな構成にし、写真を多く配置することで、店内の落ち着いた雰囲気が伝わるよう制作をしました。写真等はSNSからお借りして作成しました。',
    authentication: true,
  },
  {
    id: 3,
    title: 'システムLPサイト',
    created: '2022年4月',
    period: '1ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/kintai/dokintai/',
    description:
      'Web広告リンク先として作成。ど根性ガエルをPRキャラクターとして利用できたことから、イラスト素材を最大限に活かしサービス名の認知・システムの特徴をわかりやすく表現することを意識して制作しました。',
  },
  {
    id: 4,
    title: 'かえる勤怠管理システム',
    created: '2020年6月',
    period: '5ヶ月',
    role: 'コーディング',
    url: 'https://www.japanpt.org/',
    description:
      'メインプロダクトである勤怠管理システムのWebサイトのリニューアルでコーディング担当。管理画面からお知らせを投稿できるようWordPressを使って構築し、「よくある質問」においてはキーワードでの検索が可能となるようjQueryで実装しました。',
  },
  {
    id: 5,
    title: '勤怠管理システムコラムサイト',
    created: '2022年8月',
    period: '1.5ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/column/',
    description: '総務・人事担当者をターゲットにしたブログを書くために構築したコラムサイト。シンプルに作ったよ。',
  },
  {
    id: 6,
    title: '勤怠管理システムヘルプサイト',
    created: '2022年5月',
    period: '1.5ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/guid/',
    description:
      '勤怠管理システムの使い方を紹介するヘルプサイトの制作において、デザインとコーディングを担当。コンテンツを適切にまとめることを意識して制作しました。詳細ページでは次ページへの遷移ボタンを配置し、サイドバーのナビゲーションには現在地を視覚的に示すことで、ユーザーがどのページにいるかを直感的に理解できるように設計いたしました。',
  },
  {
    id: 7,
    title: '[自主制作]無料コーディング練習所',
    created: '2023年11月',
    period: '１週間',
    role: 'コーディング',
    url: 'https://saku-g.github.io/nekopon-intermediate02/',
    description:
      'インプットするだけでなく、定期的にコーディングをする機会を持ちたいと思い、ねこポンさんがブログで公開されている『無料コーディング練習所』のデザインカンプからコーディングをしました。',
  },
  {
    id: 8,
    title: '[自主制作]無料コーディング練習所',
    created: '2023年11月',
    period: '１週間',
    role: 'コーディング',
    url: 'https://saku-g.github.io/nekopon-intermediate03/',
    description:
      'インプットするだけでなく、定期的にコーディングをする機会を持ちたいと思い、ねこポンさんがブログで公開されている『無料コーディング練習所』のデザインカンプからコーディングをしました。',
  },
];
