export const WORKS_CONTENTS = [
  {
    id: 1,
    title: '公立小学校のWebサイト',
    url: 'https://sacck.me/school/',
    created: '2019年8月頃',
    period: '4ヶ月',
    role: 'デザイン・コーディング',
    description:
      'Web制作の学習を一通り終わった後、はじめて制作したWebサイトです。デザインとコーディングを行い、「お知らせ」をWordPressから更新できるよう実装しました。写真素材は小学校の関係者から提供を受け、Webサイトを訪れる方々のニーズを考えながら、学校の雰囲気が感じられるよう制作を行いました。実際の公開はできませんでしたが、初めて最後まで手がけたWebサイトで思い入れがあります。',
    authentication: true,
  },
  {
    id: 2,
    title: '理容室のWebサイト',
    created: '2019年10月頃',
    period: '３週間',
    role: 'デザイン・コーディング',
    url: 'https://sacck.me/barber/',
    description:
      'サイト制作の実績を積むために、店主の了承を得て、通っている理容室のWebサイトを制作しました。写真などは、既存のWebサイトやSNSから借用して利用しています。Web上で提供されていたテンプレートを有効活用し、そのレイアウトを基にしてコンテンツを差し替え、デザインとコーディングを行いました。\n店内の雰囲気とマッチするよう、ブラウンをメインカラーとしてデザインを行い、写真を多く配置して、店内の落ち着いた雰囲気が伝わるよう制作をしました。',
    authentication: true,
  },
  {
    id: 3,
    title: 'かえる勤怠管理LP',
    created: '2022年4月',
    period: '1ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/kintai/dokintai/',
    description:
      '会社業務の制作物になります。Web広告のリンク先となるLPを制作しました。\nこのLPでは、「ど根性ガエル」をキャラクターとして活用できたため、そのイラスト素材を最大限に活かし、サービス名の認知とシステムの特徴をわかりやすく表現することに焦点を当てて制作しました。（※イラストとファーストビューの動画は外注先が制作）',
  },
  {
    id: 4,
    title: 'かえる勤怠管理',
    created: '2020年6月頃',
    period: '5ヶ月',
    role: 'コーディング',
    url: 'https://www.japanpt.org/office/',
    description:
      '会社業務の制作物になります。メインプロダクトである勤怠管理システムのWebサイトリニューアルで、コーディングを担当しました。\n管理画面からお知らせを投稿できるように、WordPressを利用してサイトを構築しました。また、「よくある質問」ページでは、キーワード検索をjQueryを使用して実装しました。',
  },
  {
    id: 5,
    title: '勤怠管理システムコラムサイト',
    created: '2020年10月頃',
    period: '1.5ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/column/',
    description:
      '会社業務の制作物になります。WordPressを使用して、製品・サービスを知らない潜在層向けに作成したコラムサイトを実装しました。サイトでは、一般的なブログレイアウトである2カラムレイアウトを採用し、視認性を高めました。さらに、サイドバーには製品へのリンクを多く配置することで、ユーザーがプロダクトを簡単に確認できるように心掛けました。',
  },
  {
    id: 6,
    title: '勤怠管理システムヘルプサイト',
    created: '2021年5月頃',
    period: '1.5ヶ月',
    role: 'デザイン・コーディング',
    url: 'https://www.japanpt.org/guid/',
    description:
      '会社業務の制作物になります。システムの使い方を紹介するヘルプサイトを制作しました。コンテンツを適切にまとめ、特に詳細ページでは次ページへのリンクを配置しました。サイドバーのナビゲーションには、現在地を視覚的に示すことで、ユーザーがどのページにいるかを直感的に理解できるように設計しました。',
  },
  {
    id: 7,
    title: 'ジムサイト（無料コーディング練習所）',
    created: '2023年11月',
    period: '１週間',
    role: 'コーディング',
    url: 'https://saku-g.github.io/nekopon-intermediate02/',
    description:
      'コーディングをする機会が減っていたため、リハビリも兼ねて、「無料コーディング練習所」で公開されているデザインカンプからコーディングを試みました。アニメーションの時間調整が難しい部分もありましたが、自分で調べていく中でclip-pathを使用したテキストアニメーションについて知ることができ、勉強になりました。',
    coding_practice: true,
  },
  {
    id: 8,
    title: 'ゲームサイト（無料コーディング練習所）',
    created: '2023年11月',
    period: '3日',
    role: 'コーディング',
    url: 'https://saku-g.github.io/nekopon-intermediate03/',
    description:
      'コーディングをする機会がめっきり減ってしまったのでリハビリも兼ねて「無料コーディング練習所」で公開されているデザインカンプからコーディングを行いました。工夫した点としては、Intersection Observerを利用して画面外のアニメーションを停止する処理を実装しました。また、固定ヘッダーにmix-blend-modeを導入し、後ろのコンテンツとの色の重なりに対処しました。',
    coding_practice: true,
  },
];
